NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_application_peripherals.h
/*USBHSCORE*/
#define USBHSCORE_PRESENT 1
#define USBHSCORE_COUNT 1

/*System protection unit*/
#define SPU_PRESENT 1
#define SPU_COUNT 4

#define SPU00_BELLS 0                                /*!< (unspecified)                                                        */
#define SPU00_IPCT 0                                 /*!< (unspecified)                                                        */
#define SPU00_DPPI 1                                 /*!< Supports FEATURE.DPPIC[n]                                            */
#define SPU00_GPIOTE 0                               /*!< (unspecified)                                                        */
#define SPU00_GRTC 0                                 /*!< (unspecified)                                                        */
#define SPU00_GPIO 1                                 /*!< Supports FEATURE.GPIO[n]                                             */
#define SPU00_CRACEN 0                               /*!< (unspecified)                                                        */
#define SPU00_MRAMC 0                                /*!< (unspecified)                                                        */
#define SPU00_COEXC 0                                /*!< (unspecified)                                                        */
#define SPU00_ANTSWC 0                               /*!< (unspecified)                                                        */
#define SPU00_TDD 0                                  /*!< (unspecified)                                                        */
#define SPU00_SLAVE_BITS 4                           /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/

#define SPU10_BELLS 0                                /*!< (unspecified)                                                        */
#define SPU10_IPCT 0                                 /*!< (unspecified)                                                        */
#define SPU10_DPPI 1                                 /*!< Supports FEATURE.DPPIC[n]                                            */
#define SPU10_GPIOTE 0                               /*!< (unspecified)                                                        */
#define SPU10_GRTC 0                                 /*!< (unspecified)                                                        */
#define SPU10_GPIO 0                                 /*!< (unspecified)                                                        */
#define SPU10_CRACEN 0                               /*!< (unspecified)                                                        */
#define SPU10_MRAMC 0                                /*!< (unspecified)                                                        */
#define SPU10_COEXC 0                                /*!< (unspecified)                                                        */
#define SPU10_ANTSWC 0                               /*!< (unspecified)                                                        */
#define SPU10_TDD 0                                  /*!< (unspecified)                                                        */
#define SPU10_SLAVE_BITS 4                           /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/

#define SPU20_BELLS 0                                /*!< (unspecified)                                                        */
#define SPU20_IPCT 0                                 /*!< (unspecified)                                                        */
#define SPU20_DPPI 1                                 /*!< Supports FEATURE.DPPIC[n]                                            */
#define SPU20_GPIOTE 1                               /*!< Supports FEATURE.GPIOTE[n]                                           */
#define SPU20_GRTC 1                                 /*!< Supports FEATURE.GRTC[n]                                             */
#define SPU20_GPIO 1                                 /*!< Supports FEATURE.GPIO[n]                                             */
#define SPU20_CRACEN 0                               /*!< (unspecified)                                                        */
#define SPU20_MRAMC 0                                /*!< (unspecified)                                                        */
#define SPU20_COEXC 1                                /*!< Supports FEATURE.COEXC[n]                                            */
#define SPU20_ANTSWC 0                               /*!< (unspecified)                                                        */
#define SPU20_TDD 0                                  /*!< (unspecified)                                                        */
#define SPU20_SLAVE_BITS 4                           /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/

#define SPU30_BELLS 0                                /*!< (unspecified)                                                        */
#define SPU30_IPCT 0                                 /*!< (unspecified)                                                        */
#define SPU30_DPPI 1                                 /*!< Supports FEATURE.DPPIC[n]                                            */
#define SPU30_GPIOTE 1                               /*!< Supports FEATURE.GPIOTE[n]                                           */
#define SPU30_GRTC 0                                 /*!< (unspecified)                                                        */
#define SPU30_GPIO 1                                 /*!< Supports FEATURE.GPIO[n]                                             */
#define SPU30_CRACEN 0                               /*!< (unspecified)                                                        */
#define SPU30_MRAMC 0                                /*!< (unspecified)                                                        */
#define SPU30_COEXC 0                                /*!< (unspecified)                                                        */
#define SPU30_ANTSWC 0                               /*!< (unspecified)                                                        */
#define SPU30_TDD 0                                  /*!< (unspecified)                                                        */
#define SPU30_SLAVE_BITS 4                           /*!< SLAVE_BITS=4 (number of address bits required to represent the
                                                          peripheral slave index)*/

/*Memory Privilege Controller*/
#define MPC_PRESENT 1
#define MPC_COUNT 2

